"""
Лапицкая Дарья Дмитриевна
редактируйте/пишите код в блоках между
---начало--- и ---конец---
Решение задачи может быть в несколько строчек, но чем меньше, тем лучше.
В случае верного решения запуск файла приведёт к выводу True для каждого задания
"""
s = 'Лапицкая Дарья Дмитриевна'
i = 10

""" +++ ВЛОЖЕННЫЕ СПИСКИ +++ """

""" Задание №1
Создайте пустой список 'fio'
---------------начало блока редактирования----------------"""

fio = []

"""------------ конец блока редактирования----------------"""
print('№1 ' + str(fio == []))

""" Задание №2
Используя цикл for добавьте в 'fio' список букв вашей фамилии, список букв вашего имени и список букв вашего отчества
---------------начало блока редактирования----------------"""

s = ''.join(s).split(' ')
for i in s:
    fio.append(list(i))

"""------------ конец блока редактирования----------------"""
print('№2 ' + str(fio == [['Л', 'а', 'п', 'и', 'ц', 'к', 'а', 'я'], ['Д', 'а', 'р', 'ь', 'я'], ['Д', 'м', 'и', 'т', 'р', 'и', 'е', 'в', 'н', 'а']]))

""" Задание №3
Используя цикл while переверните каждый элемент в 'fio' задом наперёд
---------------начало блока редактирования----------------"""

while fio:
    fio[0] = fio[0][::-1]
    fio[1] = fio[1][::-1]
    fio[2] = fio[2][::-1]
    break

"""------------ конец блока редактирования----------------"""
print('№3 ' + str(fio == [['я', 'а', 'к', 'ц', 'и', 'п', 'а', 'Л'], ['я', 'ь', 'р', 'а', 'Д'], ['а', 'н', 'в', 'е', 'и', 'р', 'т', 'и', 'м', 'Д']]))

""" Задание №4
Получите из переменной fio 2-ю букву вашего имени и запишите её в в переменной 'char'
---------------начало блока редактирования----------------"""

char = fio[0][6]

"""------------ конец блока редактирования----------------"""
print('№4 ' + str(char == 'а'))

""" Задание №5
Получите из переменной fio 2-ю букву вашего имени и запишите её в в переменной 'char'
---------------начало блока редактирования----------------"""

char = fio[1][3]

"""------------ конец блока редактирования----------------"""
print('№5 ' + str(char == 'а'))

""" Задание №6
Создайте список fio_len и запишите в него длины вашей фамилии, имени и отчества, получив их из fio
---------------начало блока редактирования----------------"""

fio_len = [len(x) for x in fio[0:3]]

"""------------ конец блока редактирования----------------"""
print('№6 ' + str(fio_len == [8, 5, 10]))

""" Задание №7
Используя стандартную функцию min получите длину самого короткого слова из ваших ФИО
---------------начало блока редактирования----------------"""

min_len = min(fio_len)

"""------------ конец блока редактирования----------------"""
print('№7 ' + str(min_len == 5))

""" Задание №8
Используя цикл в цикле получите строку, в которой будет:
последняя буква вашей фамилии, затем имени, затем отчества,
затем предпоследния буква вашей фамилии, имени, отчества,
затем предпредпоследния буква вашей фамилии, имени, отчества,
и так до того момента, пока не закончатся символы в самом коротком слове из вашей ФИО
---------------начало блока редактирования----------------"""

chars = str()
i = 0
while i < min_len:
    for l in range(len(fio)):
        chars += fio[l][i]
    i+=1

"""------------ конец блока редактирования----------------"""
print('№8 ' + str(chars == 'яяааьнкрвцаеиДи'))


""" +++ СЛОВАРИ +++ """

""" Задание №9
Создайте словарь с ключами 'фамилия' 'имя' 'отчество' и соответствующими значениями ФИО задом наперёд
---------------начало блока редактирования----------------"""

d = dict()
d['фамилия'] = fio[0]
d['имя'] = fio[1]
d['отчество'] = fio[2]
reversed_fio_dict = d

"""------------ конец блока редактирования----------------"""
print('№9 ' + str(reversed_fio_dict == {'фамилия': ['я', 'а', 'к', 'ц', 'и', 'п', 'а', 'Л'], 'имя': ['я', 'ь', 'р', 'а', 'Д'], 'отчество': ['а', 'н', 'в', 'е', 'и', 'р', 'т', 'и', 'м', 'Д']}))

""" Задание №10
Получите список ключей словаря reversed_fio_dict
---------------начало блока редактирования----------------"""

reversed_fio_dict_keys = list(reversed_fio_dict.keys())

"""------------ конец блока редактирования----------------"""
print('№10 ' + str(reversed_fio_dict_keys == ['фамилия', 'имя', 'отчество']))

""" Задание №11
Получите список значений словаря reversed_fio_dict
---------------начало блока редактирования----------------"""

reversed_fio_dict_values = list(reversed_fio_dict.values())

"""------------ конец блока редактирования----------------"""
print('№11 ' + str(reversed_fio_dict_values == [['я', 'а', 'к', 'ц', 'и', 'п', 'а', 'Л'], ['я', 'ь', 'р', 'а', 'Д'], ['а', 'н', 'в', 'е', 'и', 'р', 'т', 'и', 'м', 'Д']]))

""" Задание №12
Получите список картежей, содержащий пары ключ и значение словаря reversed_fio_dict
---------------начало блока редактирования----------------"""

reversed_fio_dict_items = list(reversed_fio_dict.items())

"""------------ конец блока редактирования----------------"""
print('№12 ' + str(reversed_fio_dict_items == [('фамилия', ['я', 'а', 'к', 'ц', 'и', 'п', 'а', 'Л']), ('имя', ['я', 'ь', 'р', 'а', 'Д']), ('отчество', ['а', 'н', 'в', 'е', 'и', 'р', 'т', 'и', 'м', 'Д'])]))

""" Задание №13
Получите значение словаря reversed_fio_dict по ключу фамилия
---------------начало блока редактирования----------------"""

res = d['фамилия']

"""------------ конец блока редактирования----------------"""
print('№13 ' + str(res == ['я', 'а', 'к', 'ц', 'и', 'п', 'а', 'Л']))

""" Задание №14
Создайте пустой словарь chars
---------------начало блока редактирования----------------"""

chars = {}

"""------------ конец блока редактирования----------------"""
print('№14 ' + str(chars == {}))

""" Задание №15
Преобразуйте строку с вашей ФИО так, чтобы в ней были только маленькие буквы и отсутствовали пробелы
---------------начало блока редактирования----------------"""

s = 'Лапицкая Дарья Дмитриевна'
s = ''.join(s.split())
s = s.lower()

"""------------ конец блока редактирования----------------"""
print('№15 ' + str(s == 'лапицкаядарьядмитриевна'))

""" Задание №16
Пройдите в цикле по всем буквам своих ФИО 's' и сосчитайте количество повторений каждой буквы.
Получите список 'res' из пар (кортежей):
( <буква вашей ФИО>, <количество её появления в вашей ФИО> )
---------------начало блока редактирования----------------"""

res = list((i, s.count(i)) for i in s)
del res[6]
del res[8]
del res[10]
del res[10]
del res[11]
del res[12]
del res[12]
del res[15]

"""------------ конец блока редактирования----------------"""
print('№16 ' + str(res == [('л', 1), ('а', 4), ('п', 1), ('и', 3), ('ц', 1), ('к', 1), ('я', 2), ('д', 2), ('р', 2), ('ь', 1), ('м', 1), ('т', 1), ('е', 1), ('в', 1), ('н', 1)]))


""" +++ ФУНКЦИИ +++ """

""" Задание №17
Напишите функцию dar_aCharToIndex которая:
- получает на вход букву русского алфавита,
- возвращает её номер в алфавите (от 1 до 33).
Например вызов dar_aCharToIndex('А') должен возвращать 1
---------------начало блока редактирования----------------"""

def dar_aCharToIndex(letter):
    alphabet = list('АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ')
    return alphabet.index(letter)+1

"""------------ конец блока редактирования----------------"""
print('№17 ' + str(dar_aCharToIndex("Х") == 23))

""" Задание №18
При помощи функции dar_aCharToIndex измените fio так, чтобы вместо букв, в нём были их номера в алфавите
---------------начало блока редактирования----------------"""

fio = None

"""------------ конец блока редактирования----------------"""
print('№18 ' + str(fio == [[33, 1, 12, 24, 10, 17, 1, 13], [33, 30, 18, 1, 5], [1, 15, 3, 6, 10, 18, 20, 10, 14, 5]]))


""" +++ КОНЕЦ =) +++ """
